# Brewfile

# Shell tools
brew "zsh-completions"
brew "fzf"
brew "ripgrep"
brew "sheldon"

# Modern CLI tools
brew "bat"          # catの代替（シンタックスハイライト）
brew "eza"          # lsの代替（見やすい表示）
brew "fd"           # findの代替（高速検索）
brew "htop"         # top/psの代替（リソース監視）
brew "jq"           # JSON処理
brew "tree"         # ディレクトリ構造表示
brew "tmux"         # ターミナル多重化
brew "wget"         # ファイルダウンロード

# Development tools
brew "neovim"
brew "node"
brew "python3"
brew "direnv"
brew "git"
brew "glab"         # GitLab CLI
brew "curl"
brew "uv"           # Python package manager（Spec Kit用）

# Learning tools
cask "anki"         # 間隔反復学習（SRS）ツール
brew "poppler"      # PDF処理ツール（pdftotext）

# Terminal
cask "ghostty"      # モダンなGPUアクセラレーション対応ターミナル

# Fonts
cask "font-jetbrains-mono"  # プログラミング用フォント
